# Part B: Load SQL Results into pandas

## Step 3: Load one query result

In [1]:
# Import Libraries
import pandas as pd
import sqlalchemy

# Access the project database
engine = sqlalchemy.create_engine("sqlite:///project.db")

# Access the SQL query file and create a dataframe of the table created by Query 1
with open("week6_multi_table_queries.sql", "r") as f:
    queries = f.read().split(";")

queries = [q.strip() for q in queries if q.strip()]

df = pd.read_sql_query(queries[0], con=engine)

In [2]:
# Export dataframe to .csv
df.to_csv("query1_result", index=False)

In [3]:
# Import the dataframe
df = pd.read_csv("query1_result")

In [4]:
# Inspect first 5 rows
df.head()

         date  aqi parameter_name state_name
0  2025-01-01   20          PM2.5    Alabama
1  2025-01-01   22           PM10    Arizona
2  2025-01-01   26          Ozone   Arkansas

In [5]:
# Display column names, non-null count, and data data types
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   date            3 non-null      object
 1   aqi             3 non-null      int64
 2   parameter_name  3 non-null      object
 3   state_name      3 non-null      object
dtypes: int64(1), object(3)
memory usage: 228.0+ bytes

In [6]:
# Display summary statistics of numerical columns
df.describe()

             aqi
count   3.000000
mean   22.666667
std     3.055050
min    20.000000
25%    21.000000
50%    22.000000
75%    24.000000
max    26.000000

## Parts C: Steps 4 and 5

In [7]:
df.head()

         date  aqi parameter_name state_name
0  2025-01-01   20          PM2.5    Alabama
1  2025-01-01   22           PM10    Arizona
2  2025-01-01   26          Ozone   Arkansas

In [8]:
df.isnull().sum()

date              0
aqi               0
parameter_name    0
state_name        0
dtype: int64

## Apply at least two missing-data strategies (Only applied one since i am only working with 3 rows)

#### - The dataset contains no missing values. Therefore, no rows or columns were dropped, and no imputation was necessary.

In [9]:
df.dropna()

         date  aqi parameter_name state_name
0  2025-01-01   20          PM2.5    Alabama
1  2025-01-01   22           PM10    Arizona
2  2025-01-01   26          Ozone   Arkansas

## Filling numerical columns columns

In [14]:
## Filling numerical columns columns
numeric_cols = df.select_dtypes(include='number').columns
df[numeric_cols] = df[numeric_cols].fillna(df[numeric_cols].mean())

In [16]:
df.head()

         date  aqi parameter_name state_name
0  2025-01-01   20          PM2.5    Alabama
1  2025-01-01   22           PM10    Arizona
2  2025-01-01   26          Ozone   Arkansas

#### Summary
The dataset was first checked for missing values using df.isnull().sum() to identify any null entries in each column. No missing values were found in the dataset. However, if any missing values had been present in the numeric column (AQI), they would have been filled using the mean of the column. Filling missing values with the mean helps preserve the overall dataset size and maintains the average distribution of the data. This approach prevents data loss that would occur if rows were removed and ensures the dataset remains suitable for analysis.

## Part 5
- Rename columns names
- Standardize Capitalization
- Remove Duplicates (If Any)

In [17]:
df = df.rename(columns={
    'date': 'Date',
    'aqi': 'AQI',
    'parameter_name': 'Parameter',
    'state_name': 'State'
})

In [18]:
print(df.columns)

Index(['Date', 'AQI', 'Parameter', 'State'], dtype='object')

In [19]:
df = df.drop_duplicates()

In [20]:
df.head()

         Date  AQI Parameter     State
0  2025-01-01   20     PM2.5   Alabama
1  2025-01-01   22      PM10   Arizona
2  2025-01-01   26     Ozone  Arkansas